Revit 2026 API

# SolidCurveIntersection Class

---

This class represents the results of a calculation of intersection between a solid volume and a curve.

SystemObject Autodesk.Revit.DBSolidCurveIntersection

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SolidCurveIntersection : IEnumerable<Curve>,
	IDisposable
```
```vb
Public Class SolidCurveIntersection
	Implements IEnumerable(Of Curve), IDisposable
```
```cpp
public ref class SolidCurveIntersection : IEnumerable<Curve^>,
	IDisposable
```
```fsharp
type SolidCurveIntersection =
    class
        interface IEnumerable<Curve>
        interface IDisposable
    end
```

The SolidCurveIntersection type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | ResultType | The result type used to calculate the intersections. |
|  | SegmentCount | The number of segments in the results. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the SolidCurveIntersection |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetBasicIEnumerator | Returns an enumerator that iterates through a collection. |
|  | GetCurveSegment | Gets the curve segment generated by intersection. |
|  | GetCurveSegmentExtents | Gets the extents for the given curve segment generated by intersection. |
|  | GetEnumerator | Returns an enumerator that iterates through a collection. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

The results contain a collection of curves and a collection of curve extents (which are the parameters of intersection from the original input curve). Depending on the SolidCurveIntersectionMode option passed when executing the calculation, the curve segments and curve extents represent either the extents of the curve which exist inside the solid, or the extents of the curve which exist outside the solid. If the curve is entirely inside the solid, and the option is CurveSegmentsOutside, or if the curve is entirely outside the solid, and the option is CurveSegmentsInside, this results object will be empty. Note that curves aligned with the bounding faces of the solid are considered to be inside by this utility.

#### Reference

Autodesk.Revit.DB Namespace